Merge pull request #5 from zozo6015/feature/update-docs-and-readme
update docs and README
